---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricArea.GetTotalSheetMass
source: html/53bbfc7e-3255-6e68-7339-5dd39af0d75b.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.GetTotalSheetMass Method

Calculates the total sheet mass: Volume of Wire * Unit Weight.

## Syntax (C#)
```csharp
public double GetTotalSheetMass()
```

## Returns
The total sheet mass.